/*******************************************************************
********************************************************************
********************************************************************

 NEXSUS GAME Create System created 2001.07.27
 Object Control Handler

********************************************************************
********************************************************************
********************************************************************/

#include "stdio.h"
#include "nexsusdev.h"

/*******************************************************************
 渡されたオブジェクトのプロセスを指定する
*******************************************************************/
void NX_SetProcess( Puserparam usrprm, short num )
{
	usrprm -> processnum = num;
}
/**/

/*******************************************************************
 指定されたオブジェクトのプロセス番号を進める
*******************************************************************/
void NX_NextProcess( Puserparam usrprm )
{
	usrprm -> processnum++;
}
/**/

/*******************************************************************
 指定されたオブジェクトのプロセス番号を戻す
*******************************************************************/
void NX_PreviousProcess( Puserparam usrprm )
{
	if( usrprm -> processnum > 1 ){
		usrprm -> processnum--;
	}
}
/**/

/*******************************************************************
 オブジェクトを抹消する
*******************************************************************/
void NX_DelObject( Puserparam usrprm )
{
	mfunc		*mfx;
	PmasterObj	mobj;

	mobj = NX_GetObject( usrprm -> num );

	// デストラクタ処理
	mfx = ( mfunc * )mobj -> process;
	if( mfx != NULL ){
		usrprm -> processnum = NX_DEST;
		( *mfx )( usrprm, NULL );
	}

	mobj -> active = 0;
	usrprm -> visible = 0;
}
/**/
