/*******************************************************************
********************************************************************
********************************************************************

 NEXSUS GAME Create System created 2001.06.22
 gtk+ : Utility routine(header)

********************************************************************
********************************************************************
********************************************************************/

#ifndef gint
//#include <gtk/gtk.h>
#endif

extern void		NX_MessageBox( char *title, char *str, char *btitle );	// メッセージボックスを出す
extern short	NX_StrPos( char *str1, char *str2 );
extern long		NX_GetRandom( long, long );
